Repository: biblibre/omeka-s-module-Alto
Catalog: language/*.po
Languages: fr

source: Replace with another ALTO document
fr: Remplacer par un autre document ALTO

source: Delete this ALTO document
fr: Supprimer ce document ALTO

source: No ALTO document is attached to this media.
fr: Aucun document ALTO n'est attaché à ce média.

source: Attach an ALTO document
fr: Attacher un document ALTO

source: Attach ALTO to media
fr: Attacher ALTO au média

source: ALTO text content
fr: Contenu texte de ALTO

source: ALTO file
fr: Fichier ALTO

source: Attach
fr: Attacher

source: ALTO document attached
fr: Document ALTO attaché

source: ALTO document
fr: document ALTO

source: ALTO document deleted
fr: Document ALTO supprimé
