Repository: biblibre/omeka-s-module-Alto
Catalog: documentation/locales/*/LC_MESSAGES/index.po
Languages: fr

source: User manual
fr: Manuel utilisateur

source: Alto (Omeka S module)
fr: Alto (module Omeka S)

source: This Omeka S module allows to attach ALTO (XML) files to media. The ALTO content can then be used in several ways (for display, search, ...).
fr: Ce module Omeka S permet d'attacher des fichiers ALTO (XML) aux médias. Le contenu ALTO peut ensuite être utilisé de plusieurs manières (pour l'affichage, la recherche, ...).

source: Requirements
fr: Pré-requis

source: Omeka S ≥ 3.2.0 (or ≥ 4.0.0 if you need resource page blocks)
fr: Omeka S ≥ 3.2.0 (ou ≥ 4.0.0 si vous avez besoin des blocs de page de ressource)

source: For search capabilities, modules `Search <https://github.com/biblibre/omeka-s-module-Search>`__ and `Solr <https://github.com/biblibre/omeka-s-module-Solr>`__
fr: Pour les capacités de recherche, les modules `Search <https://github.com/biblibre/omeka-s-module-Search>`__ et `Solr <https://github.com/biblibre/omeka-s-module-Solr>`__

source: Quick start
fr: Démarrage rapide

source: `Install the module <https://omeka.org/s/docs/user-manual/modules/#adding-modules-to-omeka-s>`__
fr: `Installer le module <https://omeka.org/s/docs/user-manual/modules/#adding-modules-to-omeka-s>`__

source: In the admin interface, on a media page there is a new tab "ALTO". Click the tab, then click on "Attach an ALTO document". In the sidebar, select an ALTO file and submit the form.
fr: Dans l'interface d'administration, sur la page d'un média il y a un nouvel onglet "ALTO". Cliquez sur l'onglet, puis cliquez sur "Attacher un document ALTO". Dans la barre latérale, sélectionnez un fichier ALTO et soumettez le formulaire.

source: To learn how to exploit ALTO files (display, search, ...), go to the table of contents at the end of this page.
fr: Pour découvrir comment exploiter les fichiers ALTO (affichage, recherche, ...), rendez vous à la table des matières à la fin de cette page.

source: Features
fr: Fonctionnalités

source: Import ALTO files one by one or by batch
fr: Import de fichiers ALTO un par un ou par lot

source: Resource page block rendering ALTO content as plain text (requires Omeka S ≥ 4.0.0)
fr: Bloc de page de ressource affichant le contenu ALTO en texte brut (nécessite Omeka S ≥ 4.0.0)

source: Integration with the `Solr <https://github.com/biblibre/omeka-s-module-Solr>`__ module (makes the ALTO plain text content searchable)
fr: Intégration avec le module `Solr <https://github.com/biblibre/omeka-s-module-Solr>`__ (rend le contenu texte brut ALTO cherchable)

source: Caveats / Known problems
fr: Avertissements / Problèmes connus

source: Batch import is very limited at the moment: it requires that the ALTO file has the same basename than the media filename (for instance, ``PAGE0001.png`` and ``PAGE00001.xml``). This should change in a future version
fr: L'import par lot est très limité pour le moment: il nécessite que le fichier ALTO porte le même nom que le fichier du média (par exemple, ``PAGE0001.png`` et ``PAGE00001.xml``). Ça devrait changer dans une version future

source: How to contribute
fr: Comment contribuer

source: If you found a bug or want to suggest a new feature, please `open an issue <https://github.com/biblibre/omeka-s-module-Alto/issues/new>`__.
fr: Si vous avez trouvé un `bug` ou voulez suggérer une nouvelle fonctionnalité, merci d'`ouvrir un ticket <https://github.com/biblibre/omeka-s-module-Alto/issues/new>`__.

source: If you made a modification to the module (bugfix, enhancement, ...) and want to make it available to everyone, `open a pull request <https://docs.github.com/en/pull-requests/collaborating-with-pull-requests/proposing-changes-to-your-work-with-pull-requests/creating-a-pull-request>`__. To increase its chances of being reviewed and merged, please keep the pull request small:
fr: Si vous avez modifié le module (correction de bug, amélioration, ...) et voulez en faire profiter tout le monde, `ouvrez une pull request <https://docs.github.com/en/pull-requests/collaborating-with-pull-requests/proposing-changes-to-your-work-with-pull-requests/creating-a-pull-request>`__. Pour améliorer ses chances d'être examinée et intégrée, faites en sorte que la *pull request* reste petite:

source: only one change per pull request (eg. do not mix a bugfix with a new feature),
fr: seulement un changement par *pull request* (ex: ne mélangez pas une correction de bug avec une nouvelle fonctionnalité),

source: include only necessary changes (eg. no code style changes)
fr: n'incluez que les changements nécessaires (ex: pas de changements dans le style du code)

source: Contributors / Sponsors
fr: Contributeurs / Sponsors

source: This module was sponsored by:
fr: Ce module a été sponsorisé par:

source: License
fr: Licence

source: This module is distributed under the GNU General Public License, version 3 (GPLv3). The full text of this license is given in the ``LICENSE`` file.
fr: Ce module est distribué sous licence publique générale GNU, version 3 (GPLv3). Le texte complet de cette licence est donné dans le fichier ``LICENSE``.
