Repository: biblibre/omeka-s-module-Alto
Catalog: documentation/locales/*/LC_MESSAGES/user.po
Languages: fr

source: Attach ALTO to a media
fr: Attacher ALTO à un média

source: Manual import
fr: Import manuel

source: To attach an ALTO document to a media, go the media page in the admin interface.
fr: Pour attacher un document ALTO à un média, allez sur la page du média dans l'interface d'administration.

source: Click on the "ALTO" tab.
fr: Cliquez sur l'onglet "ALTO".

source: Click on "Attach an ALTO document". A sidebar will open.
fr: Cliquez sur "Attacher un document ALTO". Une barre latérale s'ouvrira.

source: Select your ALTO file and submit the form.
fr: Sélectionnez votre fichier ALTO et soumettez le formulaire.

source: Batch import
fr: Import par lot

source: To import multiple ALTO files at once, click on "ALTO import" in the admin navigation menu.
fr: Pour importer plusieurs fichiers ALTO en une seule fois, cliquez sur "Import ALTO" dans le menu de navigation d'administration.

source: From there, you have to select all the ALTO files that you want to import.
fr: Depuis cette page, vous devez sélectionner tous les fichiers ALTO que vous voulez importer.

source: ALTO files will be attached to media whose filename (or "source") match the ALTO filename. For instance, an ALTO file named ``PAGE0001.xml`` will be attached to the media whose filename matches ``PAGE0001.{extension}`` (eg. ``PAGE0001.png``).
fr: Les fichiers ALTO seront attachés aux médias dont le nom de fichier (ou "source") correspond au nom du fichier ALTO. Par exemple, un fichier ALTO nommé ``PAGE0001.xml`` sera attaché au média dont le nom de fichier correspond à ``PAGE0001.{extension}`` (ex: ``PAGE0001.png``).

source: For files with multiple extensions (eg. ``PAGE.0001.alto.xml``), extensions are removed one by one until a match is found (eg. ``PAGE.0001.alto`` then ``PAGE.0001`` then ``PAGE``).
fr: Pour les fichiers avec plusieurs extensions (ex: ``PAGE.0001.alto.xml``), les extensions sont retirées une par une jusqu'à ce qu'une correspondance soit trouvée (ex: ``PAGE.0001.alto`` puis ``PAGE.0001`` puis ``PAGE``).

source: If no media or several media match, the ALTO file is not imported.
fr: Si aucun média ou plusieurs médias correspondent, le fichier ALTO n'est pas importé.

source: Replace existing ALTO documents
fr: Remplacer les documents ALTO existants

source: If checked, matching media which already have an ALTO document attached will have their ALTO document replaced
fr: Si coché, les médias correspondants qui ont déjà un document ALTO attaché auront leur document ALTO remplacé

source: Resource page block
fr: Bloc de page de ressource

source: You can display the ALTO text content on the site media page by configuring resource page blocks (requires Omeka ≥ 4.0.0).
fr: Vous pouvez afficher le contenu texte ALTO sur la page publique du média en configurant les blocs de page de ressource (nécessite Omeka ≥ 4.0.0).

source: Integration with Solr
fr: Intégration avec Solr

source: If you have the `Solr module <https://github.com/biblibre/omeka-s-module-Solr>`__ a new mapping source will be available ("Media: ALTO text content").
fr: Si vous avez le `module Solr <https://github.com/biblibre/omeka-s-module-Solr>`__ une nouvelle source de correspondance sera disponible ("Média: contenu texte ALTO").
